{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "BAR_END": 5,
      "BAR_START": 6,
      "TIME_DELTA=16": 7,
      "TIME_DELTA=1.0": 8,
      "TIME_DELTA=2.0": 9,
      "TIME_DELTA=1.3333333333333333": 10,
      "TIME_DELTA=4.0": 11,
      "TIME_DELTA=3.0": 12,
      "TIME_DELTA=16.0": 13,
      "NOTE_OFF=64": 14,
      "NOTE_ON=64": 15,
      "NOTE_OFF=69": 16,
      "NOTE_ON=69": 17,
      "NOTE_OFF=67": 18,
      "NOTE_ON=67": 19,
      "NOTE_OFF=62": 20,
      "NOTE_ON=62": 21,
      "NOTE_OFF=60": 22,
      "NOTE_ON=60": 23,
      "NOTE_OFF=72": 24,
      "NOTE_ON=72": 25,
      "NOTE_OFF=57": 26,
      "NOTE_ON=57": 27,
      "TIME_DELTA=2.6666666666666665": 28,
      "NOTE_OFF=74": 29,
      "NOTE_ON=74": 30,
      "NOTE_OFF=36": 31,
      "NOTE_ON=36": 32,
      "NOTE_OFF=43": 33,
      "NOTE_ON=43": 34,
      "NOTE_OFF=65": 35,
      "NOTE_ON=65": 36,
      "NOTE_OFF=55": 37,
      "NOTE_ON=55": 38,
      "NOTE_OFF=33": 39,
      "NOTE_ON=33": 40,
      "NOTE_OFF=71": 41,
      "NOTE_ON=71": 42,
      "NOTE_OFF=76": 43,
      "NOTE_ON=76": 44,
      "NOTE_OFF=38": 45,
      "NOTE_ON=38": 46,
      "NOTE_OFF=40": 47,
      "NOTE_ON=40": 48,
      "NOTE_OFF=45": 49,
      "NOTE_ON=45": 50,
      "NOTE_OFF=59": 51,
      "NOTE_ON=59": 52,
      "TIME_DELTA=8.0": 53,
      "NOTE_OFF=79": 54,
      "NOTE_ON=79": 55,
      "TIME_DELTA=6.0": 56,
      "NOTE_OFF=48": 57,
      "NOTE_ON=48": 58,
      "NOTE_OFF=66": 59,
      "NOTE_ON=66": 60,
      "NOTE_OFF=41": 61,
      "NOTE_ON=41": 62,
      "NOTE_OFF=52": 63,
      "NOTE_ON=52": 64,
      "DENSITY=1": 65,
      "TRACK_END": 66,
      "TRACK_START": 67,
      "NOTE_OFF=70": 68,
      "NOTE_ON=70": 69,
      "NOTE_OFF=50": 70,
      "NOTE_ON=50": 71,
      "NOTE_OFF=31": 72,
      "NOTE_ON=31": 73,
      "TIME_DELTA=0.6666666666666666": 74,
      "NOTE_OFF=35": 75,
      "NOTE_ON=35": 76,
      "NOTE_OFF=53": 77,
      "NOTE_ON=53": 78,
      "NOTE_OFF=77": 79,
      "NOTE_ON=77": 80,
      "NOTE_OFF=81": 81,
      "NOTE_ON=81": 82,
      "NOTE_OFF=68": 83,
      "NOTE_ON=68": 84,
      "NOTE_OFF=47": 85,
      "NOTE_ON=47": 86,
      "NOTE_OFF=63": 87,
      "NOTE_ON=63": 88,
      "NOTE_OFF=58": 89,
      "NOTE_ON=58": 90,
      "NOTE_OFF=75": 91,
      "NOTE_ON=75": 92,
      "NOTE_OFF=73": 93,
      "NOTE_ON=73": 94,
      "NOTE_OFF=39": 95,
      "NOTE_ON=39": 96,
      "NOTE_OFF=61": 97,
      "NOTE_ON=61": 98,
      "NOTE_OFF=78": 99,
      "NOTE_ON=78": 100,
      "NOTE_OFF=54": 101,
      "NOTE_ON=54": 102,
      "NOTE_OFF=44": 103,
      "NOTE_OFF=84": 104,
      "NOTE_ON=44": 105,
      "NOTE_ON=84": 106,
      "NOTE_OFF=56": 107,
      "NOTE_ON=56": 108,
      "NOTE_OFF=34": 109,
      "NOTE_ON=34": 110,
      "NOTE_OFF=46": 111,
      "NOTE_ON=46": 112,
      "TIME_DELTA=5.0": 113,
      "NOTE_OFF=42": 114,
      "NOTE_ON=42": 115,
      "NOTE_OFF=29": 116,
      "NOTE_ON=29": 117,
      "NOTE_OFF=51": 118,
      "NOTE_ON=51": 119,
      "NOTE_OFF=37": 120,
      "NOTE_ON=37": 121,
      "NOTE_OFF=49": 122,
      "NOTE_ON=49": 123,
      "TIME_DELTA=12.0": 124,
      "NOTE_OFF=82": 125,
      "NOTE_ON=82": 126,
      "NOTE_OFF=83": 127,
      "NOTE_ON=83": 128,
      "NOTE_OFF=86": 129,
      "NOTE_ON=86": 130,
      "TIME_DELTA=0.3333333333333333": 131,
      "NOTE_OFF=0": 132,
      "NOTE_ON=0": 133,
      "NOTE_OFF=28": 134,
      "NOTE_ON=28": 135,
      "NOTE_OFF=32": 136,
      "NOTE_ON=32": 137,
      "NOTE_OFF=80": 138,
      "NOTE_ON=80": 139,
      "TIME_DELTA=7.0": 140,
      "TIME_DELTA=10.0": 141,
      "TIME_DELTA=15.0": 142,
      "TIME_DELTA=14.0": 143,
      "TIME_DELTA=5.333333333333333": 144,
      "NOTE_OFF=88": 145,
      "NOTE_ON=88": 146,
      "TIME_DELTA=1.6666666666666667": 147,
      "TIME_DELTA=6.666666666666667": 148,
      "TIME_DELTA=9.0": 149,
      "NOTE_OFF=26": 150,
      "NOTE_ON=26": 151,
      "NOTE_OFF=30": 152,
      "NOTE_ON=30": 153,
      "TIME_DELTA=0.33333333333333337": 154,
      "TIME_DELTA=11.0": 155,
      "NOTE_OFF=85": 156,
      "NOTE_ON=85": 157,
      "NOTE_OFF=87": 158,
      "NOTE_ON=87": 159,
      "TIME_DELTA=13.0": 160,
      "NOTE_OFF=89": 161,
      "NOTE_ON=89": 162,
      "INST=0": 163,
      "PIECE_START": 164,
      "INST=1": 165,
      "INST=2": 166,
      "NOTE_OFF=24": 167,
      "NOTE_ON=24": 168,
      "INST=3": 169,
      "TIME_DELTA=9.333333333333334": 170,
      "TIME_DELTA=14.666666666666666": 171,
      "NOTE_OFF=27": 172,
      "NOTE_ON=27": 173,
      "NOTE_OFF=91": 174,
      "NOTE_ON=91": 175,
      "TIME_DELTA=10.666666666666666": 176,
      "TIME_DELTA=13.333333333333334": 177,
      "NOTE_OFF=93": 178,
      "NOTE_ON=93": 179,
      "INST=4": 180,
      "NOTE_OFF=90": 181,
      "NOTE_ON=90": 182,
      "NOTE_OFF=112": 183,
      "NOTE_ON=112": 184,
      "NOTE_OFF=23": 185,
      "NOTE_ON=23": 186,
      "NOTE_OFF=92": 187,
      "NOTE_ON=92": 188,
      "INST=5": 189,
      "TIME_DELTA=4.666666666666667": 190,
      "TIME_DELTA=0.3333333333333339": 191,
      "TIME_DELTA=2.666666666666667": 192,
      "TIME_DELTA=3.3333333333333335": 193,
      "TIME_DELTA=0.6666666666666665": 194,
      "NOTE_OFF=95": 195,
      "NOTE_ON=95": 196,
      "INST=6": 197,
      "TIME_DELTA=4.333333333333333": 198,
      "NOTE_OFF=25": 199,
      "NOTE_ON=25": 200,
      "TIME_DELTA=0.33333333333333326": 201,
      "TIME_DELTA=0.666666666666667": 202,
      "TIME_DELTA=1.6666666666666665": 203,
      "TIME_DELTA=5.666666666666667": 204,
      "INST=7": 205,
      "TIME_DELTA=0.33333333333333304": 206,
      "TIME_DELTA=0.6666666666666667": 207,
      "TIME_DELTA=2.3333333333333335": 208,
      "NOTE_OFF=103": 209,
      "NOTE_ON=103": 210,
      "NOTE_OFF=94": 211,
      "NOTE_ON=94": 212,
      "NOTE_OFF=110": 213,
      "NOTE_ON=110": 214,
      "TIME_DELTA=1.666666666666667": 215,
      "INST=8": 216,
      "TIME_DELTA=1.333333333333334": 217,
      "NOTE_OFF=19": 218,
      "NOTE_ON=19": 219,
      "TIME_DELTA=1.3333333333333335": 220,
      "NOTE_OFF=97": 221,
      "NOTE_ON=97": 222,
      "INST=9": 223,
      "TIME_DELTA=3.666666666666667": 224,
      "NOTE_OFF=98": 225,
      "NOTE_ON=98": 226,
      "NOTE_OFF=96": 227,
      "NOTE_ON=96": 228,
      "TIME_DELTA=0.6666666666666661": 229,
      "TIME_DELTA=3.6666666666666665": 230,
      "TIME_DELTA=0.3333333333333335": 231,
      "NOTE_OFF=21": 232,
      "NOTE_ON=21": 233,
      "TIME_DELTA=8.666666666666666": 234,
      "TIME_DELTA=9.666666666666666": 235,
      "TIME_DELTA=1.333333333333333": 236,
      "TIME_DELTA=2.220446049250313e-16": 237,
      "INST=10": 238,
      "NOTE_OFF=105": 239,
      "NOTE_ON=105": 240,
      "NOTE_OFF=100": 241,
      "NOTE_ON=100": 242,
      "TIME_DELTA=0.3333333333333337": 243,
      "TIME_DELTA=12.666666666666666": 244,
      "TIME_DELTA=11.666666666666666": 245,
      "TIME_DELTA=14.333333333333334": 246,
      "TIME_DELTA=15.333333333333334": 247,
      "TIME_DELTA=8.333333333333334": 248,
      "TIME_DELTA=13.666666666666666": 249,
      "TIME_DELTA=1.6666666666666674": 250,
      "TIME_DELTA=6.333333333333333": 251,
      "NOTE_OFF=20": 252,
      "NOTE_ON=20": 253,
      "INST=11": 254,
      "TIME_DELTA=7.666666666666667": 255,
      "NOTE_OFF=18": 256,
      "NOTE_ON=18": 257,
      "TIME_DELTA=2.666666666666666": 258,
      "TIME_DELTA=12.333333333333334": 259,
      "TIME_DELTA=7.333333333333333": 260,
      "TIME_DELTA=8.881784197001252e-16": 261,
      "INST=12": 262,
      "NOTE_OFF=22": 263,
      "NOTE_ON=22": 264,
      "TIME_DELTA=11.333333333333334": 265,
      "TIME_DELTA=2.333333333333334": 266,
      "TIME_DELTA=0.9999999999999998": 267,
      "TIME_DELTA=15.666666666666666": 268,
      "INST=13": 269,
      "NOTE_OFF=16": 270,
      "NOTE_ON=16": 271,
      "TIME_DELTA=2.333333333333333": 272,
      "TIME_DELTA=3.333333333333334": 273,
      "TIME_DELTA=3.666666666666666": 274,
      "INST=14": 275,
      "NOTE_OFF=14": 276,
      "NOTE_OFF=15": 277,
      "NOTE_ON=14": 278,
      "NOTE_ON=15": 279,
      "TIME_DELTA=10.333333333333334": 280,
      "TIME_DELTA=3.9999999999999996": 281,
      "TIME_DELTA=4.333333333333334": 282,
      "TIME_DELTA=0.6666666666666679": 283,
      "NOTE_OFF=12": 284,
      "NOTE_ON=12": 285,
      "TIME_DELTA=0.33333333333333215": 286,
      "TIME_DELTA=1.3333333333333321": 287,
      "INST=15": 288,
      "TIME_DELTA=1.666666666666666": 289,
      "TIME_DELTA=5.333333333333334": 290,
      "NOTE_OFF=102": 291,
      "NOTE_ON=102": 292,
      "NOTE_OFF=101": 293,
      "NOTE_ON=101": 294,
      "TIME_DELTA=0.6666666666666674": 295,
      "TIME_DELTA=4.666666666666666": 296,
      "INST=16": 297,
      "TIME_DELTA=3.333333333333333": 298,
      "TIME_DELTA=5.666666666666668": 299,
      "INST=17": 300,
      "TIME_DELTA=1.0000000000000004": 301,
      "TIME_DELTA=3.000000000000001": 302,
      "TIME_DELTA=6.333333333333334": 303,
      "INST=18": 304,
      "NOTE_OFF=107": 305,
      "NOTE_ON=107": 306,
      "NOTE_OFF=13": 307,
      "NOTE_ON=13": 308,
      "TIME_DELTA=1.9999999999999996": 309,
      "TIME_DELTA=6.666666666666668": 310,
      "TIME_DELTA=7.666666666666666": 311,
      "TIME_DELTA=1.3333333333333337": 312,
      "INST=19": 313,
      "NOTE_OFF=104": 314,
      "NOTE_ON=104": 315,
      "TIME_DELTA=2.6666666666666674": 316,
      "TIME_DELTA=21.0": 317,
      "TIME_DELTA=24.0": 318,
      "TIME_DELTA=29.0": 319,
      "NOTE_OFF=108": 320,
      "NOTE_OFF=99": 321,
      "NOTE_ON=108": 322,
      "NOTE_ON=99": 323,
      "TIME_DELTA=1.3333333333333348": 324,
      "NOTE_OFF=106": 325,
      "NOTE_OFF=17": 326,
      "NOTE_OFF=7": 327,
      "NOTE_ON=106": 328,
      "NOTE_ON=17": 329,
      "NOTE_ON=7": 330,
      "TIME_DELTA=1.6666666666666676": 331,
      "TIME_DELTA=18.0": 332,
      "TIME_DELTA=2.000000000000001": 333,
      "TIME_DELTA=3.0000000000000013": 334,
      "TIME_DELTA=8.666666666666668": 335,
      "INST=20": 336,
      "INST=21": 337,
      "TIME_DELTA=1.0000000000000009": 338,
      "TIME_DELTA=17.333333333333332": 339,
      "TIME_DELTA=19.0": 340,
      "TIME_DELTA=2.999999999999999": 341,
      "TIME_DELTA=20.0": 342,
      "TIME_DELTA=26.0": 343,
      "TIME_DELTA=27.0": 344,
      "TIME_DELTA=28.0": 345,
      "TIME_DELTA=32.0": 346,
      "TIME_DELTA=4.000000000000001": 347,
      "TIME_DELTA=44.0": 348,
      "TIME_DELTA=5.666666666666666": 349,
      "TIME_DELTA=6.666666666666666": 350,
      "INST=22": 351,
      "TIME_DELTA=0.3333333333333328": 352,
      "TIME_DELTA=0.6666666666666676": 353,
      "TIME_DELTA=1.6666666666666679": 354,
      "TIME_DELTA=125.66666666666667": 355,
      "TIME_DELTA=17.0": 356,
      "TIME_DELTA=35.0": 357,
      "TIME_DELTA=5.333333333333335": 358,
      "TIME_DELTA=7.333333333333335": 359,
      "INST=23": 360,
      "TIME_DELTA=0.0": 361,
      "TIME_DELTA=0.9999999999999982": 362,
      "TIME_DELTA=1.0000000000000002": 363,
      "TIME_DELTA=1.0000000000000013": 364,
      "TIME_DELTA=13.333333333333332": 365,
      "TIME_DELTA=18.666666666666668": 366,
      "TIME_DELTA=2.666666666666668": 367,
      "TIME_DELTA=22.666666666666668": 368,
      "TIME_DELTA=25.333333333333332": 369,
      "TIME_DELTA=29.333333333333332": 370,
      "TIME_DELTA=3.0000000000000004": 371,
      "TIME_DELTA=30.333333333333332": 372,
      "TIME_DELTA=51.0": 373,
      "TIME_DELTA=6.661338147750939e-16": 374,
      "TIME_DELTA=61.0": 375,
      "INST=24": 376,
      "INST=25": 377,
      "INST=26": 378,
      "NOTE_OFF=113": 379,
      "NOTE_ON=113": 380,
      "TIME_DELTA=0.33333333333333437": 381,
      "TIME_DELTA=1.0000000000000007": 382,
      "TIME_DELTA=125.33333333333333": 383,
      "TIME_DELTA=173.0": 384,
      "TIME_DELTA=180.0": 385,
      "TIME_DELTA=2.333333333333332": 386,
      "TIME_DELTA=20.666666666666668": 387,
      "TIME_DELTA=21.333333333333332": 388,
      "TIME_DELTA=22.0": 389,
      "TIME_DELTA=23.0": 390,
      "TIME_DELTA=25.0": 391,
      "TIME_DELTA=26.666666666666668": 392,
      "TIME_DELTA=27.333333333333332": 393,
      "TIME_DELTA=27.666666666666668": 394,
      "TIME_DELTA=28.666666666666668": 395,
      "TIME_DELTA=3.3333333333333344": 396,
      "TIME_DELTA=3.6666666666666674": 397,
      "TIME_DELTA=3.999999999999999": 398,
      "TIME_DELTA=31.0": 399,
      "TIME_DELTA=33.0": 400,
      "TIME_DELTA=4.440892098500626e-16": 401,
      "TIME_DELTA=42.666666666666664": 402,
      "TIME_DELTA=47.0": 403,
      "TIME_DELTA=5.000000000000002": 404,
      "TIME_DELTA=74.66666666666667": 405,
      "TIME_DELTA=76.0": 406,
      "TIME_DELTA=76.33333333333333": 407,
      "TIME_DELTA=77.0": 408,
      "TIME_DELTA=78.0": 409,
      "INST=27": 410,
      "INST=28": 411,
      "INST=29": 412,
      "INST=30": 413,
      "INST=31": 414,
      "INST=32": 415,
      "INST=33": 416,
      "NOTE_OFF=11": 417,
      "NOTE_OFF=111": 418,
      "NOTE_OFF=115": 419,
      "NOTE_OFF=3": 420,
      "NOTE_ON=11": 421,
      "NOTE_ON=111": 422,
      "NOTE_ON=115": 423,
      "NOTE_ON=3": 424,
      "TIME_DELTA=1.3333333333333328": 425,
      "TIME_DELTA=1.3333333333333346": 426,
      "TIME_DELTA=10.999999999999998": 427,
      "TIME_DELTA=103.0": 428,
      "TIME_DELTA=104.66666666666667": 429,
      "TIME_DELTA=110.66666666666667": 430,
      "TIME_DELTA=113.0": 431,
      "TIME_DELTA=114.0": 432,
      "TIME_DELTA=116.33333333333333": 433,
      "TIME_DELTA=120.66666666666667": 434,
      "TIME_DELTA=121.0": 435,
      "TIME_DELTA=122.0": 436,
      "TIME_DELTA=123.0": 437,
      "TIME_DELTA=123.33333333333333": 438,
      "TIME_DELTA=124.0": 439,
      "TIME_DELTA=124.33333333333333": 440,
      "TIME_DELTA=128.66666666666666": 441,
      "TIME_DELTA=143.33333333333334": 442,
      "TIME_DELTA=145.0": 443,
      "TIME_DELTA=148.0": 444,
      "TIME_DELTA=149.0": 445,
      "TIME_DELTA=155.0": 446,
      "TIME_DELTA=164.33333333333334": 447,
      "TIME_DELTA=18.333333333333332": 448,
      "TIME_DELTA=2.0000000000000004": 449,
      "TIME_DELTA=22.333333333333332": 450,
      "TIME_DELTA=23.666666666666668": 451,
      "TIME_DELTA=25.666666666666668": 452,
      "TIME_DELTA=30.666666666666668": 453,
      "TIME_DELTA=31.333333333333332": 454,
      "TIME_DELTA=32.333333333333336": 455,
      "TIME_DELTA=33.333333333333336": 456,
      "TIME_DELTA=34.0": 457,
      "TIME_DELTA=34.333333333333336": 458,
      "TIME_DELTA=37.333333333333336": 459,
      "TIME_DELTA=38.0": 460,
      "TIME_DELTA=38.666666666666664": 461,
      "TIME_DELTA=39.666666666666664": 462,
      "TIME_DELTA=4.333333333333332": 463,
      "TIME_DELTA=4.666666666666668": 464,
      "TIME_DELTA=4.999999999999999": 465,
      "TIME_DELTA=40.0": 466,
      "TIME_DELTA=41.0": 467,
      "TIME_DELTA=41.333333333333336": 468,
      "TIME_DELTA=42.0": 469,
      "TIME_DELTA=42.333333333333336": 470,
      "TIME_DELTA=43.0": 471,
      "TIME_DELTA=43.666666666666664": 472,
      "TIME_DELTA=46.666666666666664": 473,
      "TIME_DELTA=49.0": 474,
      "TIME_DELTA=50.0": 475,
      "TIME_DELTA=53.666666666666664": 476,
      "TIME_DELTA=54.666666666666664": 477,
      "TIME_DELTA=55.333333333333336": 478,
      "TIME_DELTA=57.0": 479,
      "TIME_DELTA=6.333333333333332": 480,
      "TIME_DELTA=62.0": 481,
      "TIME_DELTA=62.333333333333336": 482,
      "TIME_DELTA=67.0": 483,
      "TIME_DELTA=7.333333333333332": 484,
      "TIME_DELTA=7.333333333333334": 485,
      "TIME_DELTA=7.999999999999999": 486,
      "TIME_DELTA=79.0": 487,
      "TIME_DELTA=8.333333333333332": 488,
      "TIME_DELTA=80.0": 489,
      "TIME_DELTA=87.0": 490,
      "TIME_DELTA=9.333333333333332": 491,
      "TIME_DELTA=9.666666666666668": 492,
      "TIME_DELTA=90.0": 493,
      "TIME_DELTA=91.33333333333333": 494,
      "TIME_DELTA=93.0": 495,
      "TIME_DELTA=98.0": 496
    },
    "unk_token": "[UNK]"
  }
}