{"version":"1.0","truncation":null,"padding":null,"added_tokens":[{"id":0,"special":true,"content":"[UNK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"[CLS]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"[SEP]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"[PAD]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":4,"special":true,"content":"[MASK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":null,"pre_tokenizer":{"type":"WhitespaceSplit"},"post_processor":null,"decoder":null,"model":{"type":"WordLevel","vocab":{"[UNK]":0,"[CLS]":1,"[SEP]":2,"[PAD]":3,"[MASK]":4,"TIME_DELTA=4.0":5,"TIME_DELTA=2.0":6,"BAR_END":7,"BAR_START":8,"TRACK_START":9,"TRACK_END":10,"DENSITY=4":11,"NOTE_OFF=62":12,"NOTE_ON=62":13,"NOTE_OFF=60":14,"NOTE_ON=60":15,"NOTE_ON=59":16,"NOTE_OFF=59":17,"NOTE_ON=61":18,"NOTE_OFF=61":19,"NOTE_OFF=64":20,"NOTE_ON=64":21,"NOTE_ON=57":22,"NOTE_OFF=57":23,"NOTE_OFF=63":24,"NOTE_ON=63":25,"NOTE_OFF=58":26,"NOTE_ON=58":27,"NOTE_OFF=65":28,"NOTE_ON=65":29,"NOTE_ON=66":30,"NOTE_OFF=66":31,"NOTE_ON=67":32,"NOTE_OFF=67":33,"NOTE_OFF=55":34,"NOTE_ON=55":35,"NOTE_OFF=56":36,"NOTE_ON=56":37,"TIME_DELTA=1.0":38,"DENSITY=1":39,"NOTE_OFF=69":40,"NOTE_ON=69":41,"INST=2":42,"INST=3":43,"PIECE_START":44,"INST=0":45,"INST=1":46,"NOTE_ON=68":47,"NOTE_OFF=68":48,"TIME_DELTA=8.0":49,"NOTE_ON=54":50,"NOTE_OFF=54":51,"NOTE_OFF=53":52,"NOTE_ON=53":53,"NOTE_OFF=70":54,"NOTE_ON=70":55,"NOTE_ON=71":56,"NOTE_OFF=71":57,"NOTE_OFF=52":58,"NOTE_ON=52":59,"NOTE_OFF=72":60,"NOTE_ON=72":61,"NOTE_OFF=51":62,"NOTE_ON=51":63,"NOTE_OFF=50":64,"NOTE_ON=50":65,"NOTE_OFF=73":66,"NOTE_ON=73":67,"NOTE_OFF=74":68,"NOTE_ON=74":69,"DENSITY=3":70,"DENSITY=2":71,"NOTE_ON=49":72,"NOTE_OFF=49":73,"NOTE_ON=48":74,"NOTE_OFF=48":75,"NOTE_ON=75":76,"NOTE_OFF=75":77,"NOTE_OFF=76":78,"NOTE_ON=76":79,"NOTE_ON=47":80,"NOTE_OFF=47":81,"NOTE_ON=46":82,"NOTE_OFF=46":83,"NOTE_ON=77":84,"NOTE_OFF=77":85,"NOTE_ON=45":86,"NOTE_OFF=45":87,"NOTE_OFF=78":88,"NOTE_ON=78":89,"TIME_DELTA=6.0":90,"DENSITY=0":91,"NOTE_OFF=79":92,"NOTE_ON=79":93,"NOTE_OFF=44":94,"NOTE_ON=44":95,"NOTE_OFF=43":96,"NOTE_ON=43":97,"TIME_DELTA=12.0":98,"NOTE_ON=42":99,"NOTE_OFF=42":100,"NOTE_OFF=80":101,"NOTE_ON=80":102,"NOTE_OFF=81":103,"NOTE_ON=81":104,"NOTE_OFF=41":105,"NOTE_ON=41":106,"NOTE_OFF=40":107,"NOTE_ON=40":108,"NOTE_OFF=82":109,"NOTE_ON=82":110,"NOTE_ON=39":111,"NOTE_OFF=39":112,"NOTE_ON=38":113,"NOTE_OFF=38":114,"NOTE_ON=83":115,"NOTE_OFF=83":116,"NOTE_OFF=84":117,"NOTE_ON=84":118,"NOTE_OFF=37":119,"NOTE_ON=37":120,"NOTE_ON=36":121,"NOTE_OFF=36":122,"NOTE_OFF=85":123,"NOTE_ON=85":124,"NOTE_ON=35":125,"NOTE_OFF=35":126,"NOTE_ON=86":127,"NOTE_OFF=86":128,"NOTE_OFF=34":129,"NOTE_ON=34":130,"TIME_DELTA=3.0":131,"NOTE_ON=33":132,"NOTE_OFF=33":133,"NOTE_OFF=87":134,"NOTE_ON=87":135,"NOTE_OFF=88":136,"NOTE_ON=88":137,"NOTE_OFF=32":138,"NOTE_ON=32":139,"NOTE_OFF=31":140,"NOTE_ON=31":141,"INST=4":142,"TIME_DELTA=0.5":143,"INST=5":144,"INST=6":145,"NOTE_OFF=89":146,"NOTE_ON=89":147,"NOTE_ON=30":148,"NOTE_OFF=30":149,"TIME_DELTA=16.0":150,"NOTE_OFF=29":151,"NOTE_ON=29":152,"INST=7":153,"NOTE_ON=90":154,"NOTE_OFF=90":155,"NOTE_OFF=28":156,"NOTE_ON=28":157,"NOTE_OFF=91":158,"NOTE_ON=91":159,"NOTE_ON=27":160,"NOTE_OFF=27":161,"NOTE_ON=26":162,"NOTE_OFF=26":163,"NOTE_OFF=92":164,"NOTE_ON=92":165,"TIME_DELTA=10.0":166,"NOTE_OFF=93":167,"NOTE_ON=93":168,"INST=12":169,"INST=8":170,"INST=10":171,"INST=14":172,"INST=9":173,"INST=13":174,"INST=11":175,"NOTE_OFF=94":176,"NOTE_ON=94":177,"NOTE_OFF=95":178,"NOTE_ON=95":179,"NOTE_OFF=24":180,"NOTE_ON=24":181,"NOTE_OFF=25":182,"NOTE_ON=25":183,"NOTE_OFF=96":184,"NOTE_ON=96":185,"NOTE_ON=98":186,"NOTE_ON=97":187,"NOTE_OFF=98":188,"NOTE_OFF=97":189},"unk_token":"[UNK]"}}